{
    "seniority": "4 года",
    "workplaces": [

        {
            "organisation": "ИПРАН",
            "position" : "Инженер-исследователь",
            "start" : "14.12.21",
            "end" : "н.в.",
            "projects" : [
                {
                    "description" : "Разрабатываю модуль препроцессинга текста для автоматического исправления опечаток в тексте.",
                    "stack" : "python / aiohttp, requests, re / spark, dask / nltk, pymorphy / multiprocessing, async / unittest.",
                    "comment" : ""
                },
                {
                    "description" : "Реализовал парсер текстовых постов пользователей, включающий препроцессинг, веб-краулинг и создание семантических эмбеддингов на выходе.",
                    "stack" : "python / bs4, requests, re / numpy, scipy / torch, transformers / aiohttp.",
                    "comment" : "Автоматизировал ручной сбор текстовых постов, реализовал структуру с обратным преобразованием эмбеддинга в текст со скоростью О(1)."
                },
                {
                    "description" : "Создал систему оптимизации и валидизации экспертно выявленных признаков текста. Признаки использовались для последующей классификации текстовых экземпляров. С помощью ген. алгоритма оптимизировалась уникальность и предсказательная способность каждого признака. Для извлечения дополнительных свойств текста в системе использовались нейросетевые модели сентимент-анализа.",
                    "stack" : "python / re, nltk, pymorphy / torch, transformers / dask, pandas / deap / pytest, unittest.",
                    "comment" : "Упростил, автоматизировал и ускорил ручной сбор специфичных признаков, дающих наилучший квалити на классификации (accuracy 0.6 -> 0.8)"
                },
                {
                    "description" : "Реализовал парсер комментариев к постам на lj. ",
                    "stack" : "python / javascript / bash / json, grpc / pandas.",
                    "comment" : ""
                },
                {
                    "description" : "Работал над системой тематического анализа текста, LDA. Классификация на основе Дирихле разложения и определение релевантных ключевых слов к каждой теме.",
                    "stack" : "python / nltk / scipy, numpy, pandas / seaborn, matplotlib.",
                    "comment" : "Моей задачей было исправление ошибок, оптимизация зависимостей, визуализация и последующая поддержка. Также в дальнейшем проводил эксперименты с разными способами векторизации, качество тематического разожения оценивалось как качество кластеризации."
                },
                {
                    "description" : "Доработка и деплой  последующей поддержкой системы ЛК.",
                    "stack" : "PHP / Apache server / Bash",
                    "comment" : ""
                }
            ]
        },
        {
            "organisation": "Фриланс / проектная деятельность",
            "position" : "Python разработчик",
            "start" : "15.08.21",
            "end" : "05.11.21",
            "projects" : [
                {
                    "description" : "Реализовал парсер информации о недвижимости.",
                    "stack" : "python, / Redis, aiohttp / Docker / FastAPI",
                    "comment": "Снизил Латенси существующего решения с ~40-50 сек. до 2~9 сек."
                },
                {
                    "description" : "Разработал модуль автоматизации управления контентом для Instagram",
                    "stack" : "python / FastAPI / PostgreSQL, Redis / Selenium, Appium",
                    "comment" : "Имплементировал управление кредами через keyring, реализовал API для Telegram клиента."
                }
            ]
        },
        {
            "organisation": "ГосНИИАС",
            "position" : "Инженер программного обеспечения",
            "start" : "12.03.20",
            "end" : "08.07.21",
            "projects" : [
                {
                    "description" : "Работал над модулем статистического анализа глазодвигательной активности, информация о саккадах шла с айтрекера.",
                    "stack" : "python, / numpy, scipy, pandas / matplotlib, seaborn",
                    "comment": ""
                },
                {
                    "description" : "Дорабатывал модуль управления голосом кабины. Реализовал модуль распознавания команд на основе Марковских цепей",
                    "stack" : "С++ / Phoenix / Markov chains",
                    "comment" : "Марковские цепи использовались в виду небольшого ограниченного набора голосовых команд. Улучшил качество распознавания команд"
                },
                {
                    "description" : "Сопровождал и поддерживал систему стендов прототипирования, исправлял неисправности в индикаторах и элементах панели управления стендов",
                    "stack" : "С#, XAML, Multithreading",
                    "comment" : "Приобрел опыт работы с большим легаси-проектом."
                },
                {
                    "description" : "Реализовал модуль мониторинга стендов прототипирования. Статистика работы, текущий статус, контроль с панели статистики.",
                    "stack" : "С# / MVC / XAML / WPF / Multithreading",
                    "comment" : "Проект познакомил с концепцией MVC и принципами мультипоточности, также C# было необходимо освоить в сжатые сроки"
                },
                {
                    "description" : "Создал систему анализа субъективных оценок, целью которой был перевод данных оценок из порядковой в шкалу интервалов (в дальнейшем планировалось применять методы анализа, предполагающие численную шкалу) За основу был взят и доработан меод Терстоуна, сходимость оценок достигалась с помощью МНК",
                    "stack" : "python / scipy, numpy, pandas / seaborn, matplotlib / json",
                    "comment" : "Адаптировал алгоритм к небольшим выборкам, тест на экспертах был дорогим и долгим, также был разработан модуль валидизации, который проверял оценки на предмет соответствия свойствам метрических расстояний"
                }
            ]
        }
    ]

}
